{"pageProps":{"frontmatter":{"author":"Erika Funa","date":"2024-04-11","draft":false,"title":"Orange put on its painter's hat for an image analytics workshop in Austria","url":"image-analytics-klagenfurt","thumbImage":"ajda.jpg","frontPageImage":"ajda.jpg","blog":["image","embedding"],"shortExcerpt = \"Teaching scenario":"showing secondary school students how to train the computer to distinguish between the paintings of the artists Monet and Manet.\"","longExcerpt = \"Teaching scenario":"showing secondary school students how to train the computer to distinguish between the paintings of the artists Monet and Manet. We were invited by the Consulate General of the Republic of Slovenia in Klagenfurt to a bilingual school in Austria, where we showcased how to teach with a pich of AI.\""},"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    a: \"a\",\n    img: \"img\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Orange puts on its painter's hat and travels to Austria! We are honoured to have been invited by the Consulate General of the Republic of Slovenia in Klagenfurt to a Slovene-Austrian bilingual school in Celovec (Klagenfurt), to give a presentation in Slovene to about 150 secondary school students and teachers on how #AI can be taught in school through practical activities, including in art!\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Ajda Pretnar Žagar from our team at the University of Ljubljana, Faculty of Computer and Information Science visited the Zweisprachige Bundeshandelsakademie Klagenfurt, where she presented a teaching scenario involving image analytics in Orange Data Mining, in particular how to train the computer to distinguish between the paintings of the artists Claude Monet and Édouard Manet, using image embeddings. We also have \", _jsx(_components.a, {\n        href: \"https://www.youtube.com/watch?v=lvgx62a8XQk&list=PLmNPvQr9Tf-aRstY69vGAPO_c5RaceBhN\",\n        children: \"a video on this topic\"\n      }), \".\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It was great to see the participants showing a lot of interest and curiosity about the topic, and the presentation was followed by a lively discussion about the future of AI and the importance of developing AI skills, knowledge, and awareness to successfully and confidently use and navigate the field.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But beyond this, this visit also had an important cultural component, strengthening a relationship between the two neighbouring countries and nourishing cultural heritage and intercultural awareness. We would like to sincerely thank Consul General Anton Novak for this wonderful opportunity and to the school director Hans Pogelschek for the warm welcome. Looking forward to many more!\"\n    }), \"\\n\", _jsx(_components.img, {\n      src: \"/blog/2024-04-image-analytics-austria/__optimized-images__/group-photo.jpg\",\n      alt: \"\",\n      width: \"5033\",\n      height: \"3417\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Ajda with the Consul General of Slovenia in Klagenfurt, Anton Novak, and the Hak-Tak school director Hans Pogelschek\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"thumbImage":{"width":3698,"height":2641,"src":"/blog/2024-04-image-analytics-austria/__optimized-images__/ajda.jpg"}},"__N_SSG":true}