{"pageProps":{"frontmatter":{"author":"Žan Mervič","date":"2023-09-19 01:00:00+00:00","draft":false,"title":"Orange Fairness - Adversarial Debiasing","thumbImage":"2023-09-19-fairness-adversarial-debiasing-thumb.png","frontPageImage":"2023-09-19-fairness-adversarial-debiasing-thumb.png","blog":["fairness","adversarial debiasing"],"shortExcerpt":"Learn how to use the Adversarial Debiasing model in Orange for fairer machine learning.","longExcerpt":"This blog post focuses on the Adversarial Debiasing model in Orange, a tool for enhancing fairness in your machine learning algorithms. We will walk through how to use it and explain the trade-offs that come with using fairness algorithms.","oldUrl":"/blog/2023/2023-09-19-fairness-adversarial-debiasing/"},"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    a: \"a\",\n    h3: \"h3\",\n    ul: \"ul\",\n    li: \"li\",\n    h2: \"h2\"\n  }, _provideComponents(), props.components), {WindowScreenshot} = _components;\n  if (!WindowScreenshot) _missingMdxReference(\"WindowScreenshot\", true);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.p, {\n      children: [\"In the \", _jsx(_components.a, {\n        href: \"/blog/2023-09-19-fairness-reweighing-preprocessor/\",\n        children: \"previous blog post\"\n      }), \", we talked about how to use the Reweighing widget as a preprocessor for a model. This blog post will discuss the Adversarial Debiasing model, a bias-aware model. We will also show how to use it in Orange.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Adversarial Debiasing:\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.a, {\n        href: \"https://arxiv.org/abs/1801.07593\",\n        children: \"Adversarial Debiasing\"\n      }), \" is an in-processing type of fairness mitigation algorithm. It is a technique that uses adversarial training to mitigate bias. It involves simultaneous training of a predictor and a discriminator. The goal of the predictor is to predict the target variable accurately. At the same time, the discriminator aims to predict the protected variable (such as gender or race) based on the predictor's predictions. The main goal is to maximize the predictor's ability to predict the target variable while reducing the discriminator's ability to predict the protected variable based on those predictions. Because of the Adversarial Debiasing implementation in the \", _jsx(_components.a, {\n        href: \"https://aif360.res.ibm.com/\",\n        children: \"AIF360\"\n      }), \" package we are using, the algorithm focuses on Disparate Impact and Statistical Parity Difference fairness metrics.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The widget's interface is shown in the image below.\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2023-09-fairness-adversarial-debiasing/2023-09-19-fairness-adversarial-debiasing.png\",\n      width: \"242\",\n      height: \"398\",\n      src: \"/blog/2023-09-fairness-adversarial-debiasing/__optimized-images__/2023-09-19-fairness-adversarial-debiasing.png\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"As seen from the image, there are some unique parameters for this widget:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Neurons in hidden layers: The number of neurons in each of the hidden layers of the neural network.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Use Debiasing: Whether to use the debiasing or not. The widget will function as a regular neural network model if this option is not selected.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Adversary loss weight: The weight of the adversary loss in the total loss function. The adversary loss is the loss function of the discriminator. The higher the weight, the more the model will try to reduce the discriminator's ability to predict the protected variable at the expense of the predictor's ability to predict the target variable.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Orange use case\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now that we know how the Adversarial Debiasing widget works and how to use it, let us look at a real-world example for a classification task.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"For this example, we will use the \", _jsx(_components.a, {\n        href: \"https://archive.ics.uci.edu/ml/datasets/adult\",\n        children: \"Adult dataset\"\n      }), \", which we have used \", _jsx(_components.a, {\n        href: \"/blog/2023-08-23-fairness-dataset-bias/\",\n        children: \"before\"\n      }), \". The Adult dataset consists of 48824 instances with 15 attributes describing demographic details from the 1994 census. The primary task is to predict if an individual earns more than $50,000 annually. Unlike previously, we will not use the As Fairness widget to select fairness attributes; instead, we will keep the default ones, \\\"sex\\\" for the protected attribute and \\\"male\\\" for the privileged protected attribute value.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We will train two Adversarial Debiasing models, one with and one without debiasing, and compare them to Random Forests.\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2023-09-fairness-adversarial-debiasing/2023-09-19-fairness-adversarial-debiasing-use-case.png\",\n      width: \"822\",\n      height: \"368\",\n      src: \"/blog/2023-09-fairness-adversarial-debiasing/__optimized-images__/2023-09-19-fairness-adversarial-debiasing-use-case.png\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2023-09-fairness-adversarial-debiasing/2023-09-19-fairness-adversarial-debiasing-scores.png\",\n      width: \"968\",\n      height: \"531\",\n      src: \"/blog/2023-09-fairness-adversarial-debiasing/__optimized-images__/2023-09-19-fairness-adversarial-debiasing-scores.png\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Test and Score shows that debiasing improved fairness metrics, particularly Disparate Impact, and Statistical Parity Difference. Without debiasing, the results are similar to that of the Random Forest model. Disparate Impact moved from 0.294 to 1.051, while Statistical Parity Difference went from -0.180 to 0.006, indicating a near-zero bias between these groups regarding favorable outcomes.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However, this does not mean all forms of bias were addressed. Equal Opportunity Difference and Average Odds Difference metrics worsened from -0.097 to 0.358 and -0.087 to 0.197, respectively. This suggests that even though the algorithm has been optimized for specific fairness criteria, other biases have emerged or become more pronounced.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Why is this happening?\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsx(_components.p, {\n          children: \"Trade-offs in fairness: Addressing one type of fairness sometimes comes at the expense of another. When we optimize for Disparate Impact or Statistical Parity Difference, it may affect how often positive outcomes are correctly predicted for both privileged and unprivileged groups (equal opportunity). Moreover, it could alter the balance between true positive rates and false positive rates for these groups (average odds difference).\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"\\n\", _jsx(_components.p, {\n          children: \"Adversarial Debiasing implementation: The current algorithm implementation aims to make predictions independent of protected attributes, focusing on balancing outcomes. This approach inherently focuses on balancing outcomes (reflected in the Disparate Impact and Statistical Parity Difference metrics). However, the nuances of other fairness measures might not be as effectively addressed.\"\n        }), \"\\n\"]\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When we use debiasing, there can also be a slight decrease in accuracy. This happens because the model is now not only trying to be accurate but also fair. This balance is a necessary trade-off we accept when we want to remove bias. However, it is worth noting that in this example, the accuracy remains comparable to the scenario without debiasing.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Next, let us look at the Box Plot widget. We will use it to show the Disparate Impact and Statistical Parity Difference, much like our previous blog approach.\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2023-09-fairness-adversarial-debiasing/2023-09-19-fairness-adversarial-debiasing-box-plot-bias.png\",\n      width: \"966\",\n      height: \"461\",\n      src: \"/blog/2023-09-fairness-adversarial-debiasing/__optimized-images__/2023-09-19-fairness-adversarial-debiasing-box-plot-bias.png\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2023-09-fairness-adversarial-debiasing/2023-09-19-fairness-adversarial-debiasing-box-plot-debias.png\",\n      width: \"967\",\n      height: \"465\",\n      src: \"/blog/2023-09-fairness-adversarial-debiasing/__optimized-images__/2023-09-19-fairness-adversarial-debiasing-box-plot-debias.png\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"From the first box plot we can see that when using the model without debiasing, males (the privileged group) tends to get classified with \\\">50K\\\" (the favorable class) more often than females (the unprivileged grouo) do. This is reflected in the Disparate Impact and Statistical Parity Difference metrics which are 0.294 and -0.180, respectively, both below their optimal value, indicating bias towards the unprivileged group.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In the second box plot, we can see that when using the model with debiasing, males and females get classified with the favorable class at a very similar rate. This is also indicated by the Disparate Impact and Statistical Parity Difference metrics which are 1.051 and 0.006, respectively, both very close to their optimal value, indicating a negligible amount of bias towards the privileged group.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\nfunction _missingMdxReference(id, component) {\n  throw new Error(\"Expected \" + (component ? \"component\" : \"object\") + \" `\" + id + \"` to be defined: you likely forgot to import, pass, or provide it.\");\n}\n","frontmatter":{},"scope":{}},"thumbImage":{"width":470,"height":513,"src":"/blog/2023-09-fairness-adversarial-debiasing/__optimized-images__/2023-09-19-fairness-adversarial-debiasing-thumb.png"}},"__N_SSG":true}