{"pageProps":{"frontmatter":{"author":"Ajda Pretnar","date":"2021-12-17","draft":false,"title":"Visualizations 101","type":"blog","thumbImage":"2021-12-17-viz.png","frontPageImage":"2021-12-17-viz.png","blog":["visualization","data mining","box plot","scatter plot","distributions"],"shortExcerpt":"How to read different visualizations?","longExcerpt":"When to use certain visualization and how to read it?","x2images":false},"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    em: \"em\",\n    h3: \"h3\",\n    strong: \"strong\"\n  }, _provideComponents(), props.components), {WindowScreenshot} = _components;\n  if (!WindowScreenshot) _missingMdxReference(\"WindowScreenshot\", true);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.p, {\n      children: [\"Orange has a wide array of visualizations, which enable exploring the data from different perspectives. But each visualization is unique - it is used for a specific purpose, which is closely related to how one interprets the plot. Let's have a look at the most common visualizations in Orange, when to use them and how to read them. We will use the \", _jsx(_components.em, {\n        children: \"heart_disease.tab\"\n      }), \" data set from the File widget in the next examples.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Scatter Plot\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Scatter plot is suitable for displaying a relationship between two numeric variables. It shows a 2-dimensional plot where points represent data instances (rows). The position of each point is defined by its value for x axis and y axis. The plot can also show relations to the third variable, either numeric or categorical, by setting the color, size, or shape of data points.\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2021-12-visualizations-101/2021-12-17-scatter-plot.png\",\n      width: \"1928\",\n      height: \"1196\",\n      src: \"/blog/2021-12-visualizations-101/__webp-images__/2021-12-17-scatter-plot.webp\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"In the above image we see a relationship between \", _jsx(_components.em, {\n        children: \"age\"\n      }), \" and \", _jsx(_components.em, {\n        children: \"max HR\"\n      }), \" for the 303 patients in the data set. The color of the point corresponds to the presence or absence of diameter narrowing. We see that the presence of heart disease is slightly more frequent at the age of 60, but the difference is not entirely clear and we should't draw too many conclusions from this. What we can conclude is that the maximum heart rate falls with age - regression lines are sloping downwards. Interestingly, the values of max HR at younger ages are already noticeably lower for patients with diameter narrowing (red points and line). That said, the average maximum heart rate for healthy patients (no diameter narrowing) approaches that for sick patients (with diameter narrowing).\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"How to read the plot\"\n      }), \": \", _jsx(_components.em, {\n        children: \"age\"\n      }), \" and \", _jsx(_components.em, {\n        children: \"max HR\"\n      }), \" are negatively correlated. The higher the age, the lower the maximum heart rate.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Box Plot\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Box plot is perfect for initial exploration of the data set. It shows basic statistics for each variable and it can handle both numeric and categorical variables.\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2021-12-visualizations-101/2021-12-17-box-plot-num2.png\",\n      width: \"1616\",\n      height: \"940\",\n      src: \"/blog/2021-12-visualizations-101/__webp-images__/2021-12-17-box-plot-num2.webp\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Box plot for numeric variables shows a whisker plot, which displays essential statistics. Above is an example with the \", _jsx(_components.em, {\n        children: \"age\"\n      }), \" variable, which is by default split by the target variable \", _jsx(_components.em, {\n        children: \"diameter narrowing\"\n      }), \" in Orange. The visualization shows two box plots, one for each target value (patients with and without diameter narrowing).\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The yellow vertical line shows the median value for each box. The blue vertical line shows the mean with the standard deviation represented by the horizontal thin blue line, which shows how \\\"spread out\\\" the values in the sample are. The big blue box is the data between the 25th and 75th percentile, that is the central 50% of the data. The line on the left extends to the minimum value, while the line of the right extends to the maximum value.\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2021-12-visualizations-101/2021-12-17-box-plot-cat.png\",\n      width: \"1646\",\n      height: \"1056\",\n      src: \"/blog/2021-12-visualizations-101/__webp-images__/2021-12-17-box-plot-cat.webp\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Categorical variables show the number (or proportion) of data instances for each value. These are no longer box plot, but stacked bar charts.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"A great option in Orange is setting the \", _jsx(_components.em, {\n        children: \"Order by relevance to subgroup\"\n      }), \" checkbox, which orders the variables in the top left box by how much their values differ between groups defined by the selected Subgroup variable. It uses Chi-square test for categorical variables and compares the means of numeric variables using Student's T for two and ANOVA for multiple groups. Values of the test statistic are displayed below the plot. Normally, higher values are preferred, but the most important is the p-value - if it is below 0.05, the difference in distributions is generally considered significant.\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"How to read the plot\"\n      }), \": \", _jsx(_components.em, {\n        children: \"thal\"\n      }), \" is the variable that best separates between patients with and without diameter narrowing. There is a higher incidence of reversable defect in patients with diameter narrowing (64% have reversable defect) than in those without diameter narrowing (17% have reversable defect).\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Distributions\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Distributions show histograms for numeric variables, where values within a given range will be assigned a bin. For categorical data, they show bar plots, that is the frequency of each value. In the below example, there are two bins, one with values below 50.87 and one with values above 50.78.\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2021-12-visualizations-101/2021-12-17-distributions.png\",\n      width: \"1894\",\n      height: \"1166\",\n      src: \"/blog/2021-12-visualizations-101/__webp-images__/2021-12-17-distributions.webp\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The widget can be used to display differences in distributions.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"How to read the plot\"\n      }), \": In the group of patients that are younger than 50 years, there is a 50% lower presence of diameter narrowing (70 % of patients don't have the condition).\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Sieve Diagram\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Sieve diagram is a complex, yet extremely useful visualization. It shows the difference between the expected and observed variable frequency. In other words, if a combination of two values, i.e. being 60 years old and having a heart disease, is more frequent than expected, Sieve diagram will show it. Hence it is primarily intended for categorical variables - numeric variables will be discretized.\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2021-12-visualizations-101/2021-12-17-sieve.png\",\n      width: \"1096\",\n      height: \"1340\",\n      src: \"/blog/2021-12-visualizations-101/__webp-images__/2021-12-17-sieve.webp\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In the scatter plot above, we observed a slightly higher incidence of diameter narrowing in patient around 60 years of age. Let us check this is Sieve diagram.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"On y axis we see \", _jsx(_components.em, {\n        children: \"diameter narrowing\"\n      }), \", with the size of each box vertically corresponding to the proportion of instances with and without condition. On x axis we see \", _jsx(_components.em, {\n        children: \"age\"\n      }), \", with the size of each box horizontally corresponding to the size of each bin. As numeric variables are discretized with equal frequency discretization, the box will always be the same size.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The color of the box corresponds to how overrepresented (blue) or underrepresented (red) a certain combination is. For example, there are 73 patients (24 %) between 55.5 and 60.5 years old in the data set. There are also 139 patients (46%) with diameter narrowing.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If these two variables would be unrelated, we would expect around 11% of patients with both values (0.24 x 0.46 = 0.11), that is patients between 55 and 60 years old with a diameter narrowing.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But if we observe the data set, we can see there are actually 15% of such patients. That is more than we would expect, so a combination of the two values could be statistically significant.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In the left corner of the plot we once again meet the Chi-squared, which tells us how significant the combination actually is.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.strong, {\n        children: \"How to read the plot\"\n      }), \": Based on the data set, it is more likely the patients between 55 and 60 years of age will have diameter narrowing. The p-value is below 0.05.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Word of caution\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Data mining is about finding patterns in the data. But sometimes, patterns are random and correlation does not necessarily mean causation. So be careful when interpreting the results. Always disclose the size of your data set and how it was gathered. Report the results with the awareness, that you are only observing a sample of the population. Remember that p-values are the chance that the null hypothesis is true. Even if the p-value is 0.05, the null hypothesis could still be true - you would actually expect this to happen 5 times out of a 100, so keep this in mind, especially when you test 100+ variables!\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\nfunction _missingMdxReference(id, component) {\n  throw new Error(\"Expected \" + (component ? \"component\" : \"object\") + \" `\" + id + \"` to be defined: you likely forgot to import, pass, or provide it.\");\n}\n","frontmatter":{},"scope":{}}},"__N_SSG":true}