{"pageProps":{"frontmatter":{"author":"Žan Mervič","date":"2023-09-19 04:00:00+00:00","draft":false,"title":"Orange Fairness - Reweighing as a preprocessor","thumbImage":"2023-09-19-fairness-reweighing-preprocessor-thumb.png","frontPageImage":"2023-09-19-fairness-reweighing-preprocessor-thumb.png","blog":["fairness","reweighing"],"shortExcerpt":"Expanding on the Orange fairness Reweighing widget: using it as a preprocessor and integrating new fairness scoring metrics.","longExcerpt":"Diving deeper into the Orange fairness Reweighing widget, we explore its use as a preprocessor for models. Discover the new widgets and fairness scoring metrics; all illustrated using the German credit dataset, supplemented with visual insights through box plots.","oldUrl":"/blog/2023/2023-09-19-fairness-reweighing-preprocessor/"},"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    a: \"a\",\n    h3: \"h3\",\n    ul: \"ul\",\n    li: \"li\",\n    h2: \"h2\"\n  }, _provideComponents(), props.components), {WindowScreenshot} = _components;\n  if (!WindowScreenshot) _missingMdxReference(\"WindowScreenshot\", true);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.p, {\n      children: [\"In the \", _jsx(_components.a, {\n        href: \"/blog/2023-09-19-fairness-reweighing-dataset/\",\n        children: \"previous blog post\"\n      }), \", we introduced the Orange fairness Reweighing widget and used it to reweigh a dataset. In this blog, we will explore another use case for the Reweighing widget: using it as a preprocessor for a specific model.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Fairness metrics:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"With the fairness addon and widgets that come with it, we also introduced four bias scoring metrics which we can use to evaluate the fairness of model predictions. The metrics are:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsxs(_components.li, {\n        children: [\"Disparate Impact (DI): The ratio of favorable outcomes for an unprivileged group to that of the privileged group. An ideal value of 1.0 means the ratio is the same for both groups.\", \"\\n\", _jsxs(_components.ul, {\n          children: [\"\\n\", _jsx(_components.li, {\n            children: \"DI < 1.0: The privileged group receives favorable outcomes at a higher rate than the unprivileged group.\"\n          }), \"\\n\", _jsx(_components.li, {\n            children: \"DI > 1.0: The privileged group receives favorable outcomes at a lower rate than the unprivileged group.\"\n          }), \"\\n\"]\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"Statistical Parity Difference (SPD): Very similar to disparate impact. Instead of the ratio, it measures the difference in favorable outcomes. An ideal value is 0.0.\", \"\\n\", _jsxs(_components.ul, {\n          children: [\"\\n\", _jsx(_components.li, {\n            children: \"SPD < 0: The privileged group has a higher rate of favorable outcomes.\"\n          }), \"\\n\", _jsx(_components.li, {\n            children: \"SPD > 0: The privileged group has a lower rate of favorable outcomes.\"\n          }), \"\\n\"]\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"Average Odds Difference (AOD): This metric calculates the average difference between the true positive rates (correctly predicting a positive outcome) and false positive rates (incorrectly predicting a positive outcome) for both the privileged and unprivileged groups. A value of 0.0 indicates equal rates for both groups, signifying fairness.\", \"\\n\", _jsxs(_components.ul, {\n          children: [\"\\n\", _jsx(_components.li, {\n            children: \"AOD < 0: Indicates bias in favor of the privileged group.\"\n          }), \"\\n\", _jsx(_components.li, {\n            children: \"AOD > 0: Indicates bias against the privileged group.\"\n          }), \"\\n\"]\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.li, {\n        children: [\"Equal Opportunity Difference (EOD): Similar to the Average Odds Difference. It measures the difference in true positive rates. An ideal value is 0.0, indicating the difference in true positive rates is the same for both groups.\", \"\\n\", _jsxs(_components.ul, {\n          children: [\"\\n\", _jsx(_components.li, {\n            children: \"EOD < 0: The privileged group has a higher true positive rate.\"\n          }), \"\\n\", _jsx(_components.li, {\n            children: \"EOD > 0: The privileged group has a lower true positive rate.\"\n          }), \"\\n\"]\n        }), \"\\n\"]\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Weighted Logistic Regression and Combine Preprocessors:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"At the time of writing, there were two limitations in using the Reweighing widget as a preprocessor:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Currently, model widgets in Orange do not account for instance weights when training.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Model widgets only accept one preprocessor widget as an input; this usually would be fine since all preprocessors can be added from a single widget called Preprocess, but Reweighing is a separate widget and thus could not be combined with other methods.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"To combat this, we introduced two new widgets which we will use in the example below:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Weighted Logistic Regression is an adapted form of the Logistic Regression widget designed to handle weighted datasets.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Combine Preprocessors, which enables users to merge multiple preprocessors into one before inputting it into a widget. This becomes handy when integrating preprocessors other than Reweighing with a model.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Orange use case\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Now that we know all the required widgets and new fairness scoring metrics, let us explore a real-world example of using the reweighing widget as a preprocessor. Doing so will allow us to use the reweighing algorithm when evaluating model performance using cross-validation, random sampling, etc.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"We will use the \", _jsx(_components.a, {\n        href: \"http://archive.ics.uci.edu/dataset/144/statlog+german+credit+data\",\n        children: \"German credit dataset\"\n      }), \" for this illustration. The German Credit is a dataset related to bank loans. The main goal is to assess an individual's credit risk - whether a person is a good or bad credit risk. The collection consists of 1,000 cases with 20 attributes, of which 13 are categorical and 7 are numerical. The attributes include financial characteristics such as the amount and purpose of the loan, employment status, and credit history, as well as personal features like age, gender, housing status, and foreign worker status. The most frequently used protected attributes in this collection are gender and age.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Like the previous blog, we will not use the As Fairness Data widget to select fairness attributes. Instead, we will use the default attributes, \\\"sex\\\" as the protected attribute and \\\"male\\\" as the privileged group, already defined in the dataset.\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2023-09-fairness-reweighing-preprocessor/2023-09-19-fairness-reweighing-preprocessor-use-case.png\",\n      width: \"1037\",\n      height: \"467\",\n      src: \"/blog/2023-09-fairness-reweighing-preprocessor/__optimized-images__/2023-09-19-fairness-reweighing-preprocessor-use-case.png\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2023-09-fairness-reweighing-preprocessor/2023-09-19-fairness-reweighing-preprocessor-scores.png\",\n      width: \"1217\",\n      height: \"471\",\n      src: \"/blog/2023-09-fairness-reweighing-preprocessor/__optimized-images__/2023-09-19-fairness-reweighing-preprocessor-scores.png\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The results show that the model using reweighing as a preprocessor achieved better fairness scores than the model without reweighing at the cost of slightly lower accuracy. The Reweighing algorithm mainly focuses on the Disparate Impact and Statistical Parity Difference metrics, which reflect the ratio and difference between the favorable outcomes of the unprivileged and privileged groups.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In this case the ratio of favorable outcomes went from 0.869 to 0.952, while the difference went from -0.105 to -0.038. Both metrics indicate less bias towards the unprivileged group.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We can easily visualize the results using a box plot. For a clearer visualization, we have used the Edit Domain widget to merge all values of each protected group into one, which resulted in two groups: males and females.\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2023-09-fairness-reweighing-preprocessor/2023-09-19-fairness-reweighing-preprocessor-box-plot-bias.png\",\n      width: \"1208\",\n      height: \"520\",\n      src: \"/blog/2023-09-fairness-reweighing-preprocessor/__optimized-images__/2023-09-19-fairness-reweighing-preprocessor-box-plot-bias.png\"\n    }), \"\\n\", _jsx(WindowScreenshot, {\n      src: \"/blog/2023-09-fairness-reweighing-preprocessor/2023-09-19-fairness-reweighing-preprocessor-box-plot-debias.png\",\n      width: \"1203\",\n      height: \"513\",\n      src: \"/blog/2023-09-fairness-reweighing-preprocessor/__optimized-images__/2023-09-19-fairness-reweighing-preprocessor-box-plot-debias.png\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The first box plot shows the ratio of favorable and unfavorable outcomes for the unprivileged and privileged groups for predictions from the model without reweighing. The second box plot shows the same for the model with reweighing.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We can see that when using reweighing the amount of favorable outcomes increased for the unprivileged group and decreased for the privileged group bringing the ratios closer between the two groups.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\nfunction _missingMdxReference(id, component) {\n  throw new Error(\"Expected \" + (component ? \"component\" : \"object\") + \" `\" + id + \"` to be defined: you likely forgot to import, pass, or provide it.\");\n}\n","frontmatter":{},"scope":{}},"thumbImage":{"width":856,"height":500,"src":"/blog/2023-09-fairness-reweighing-preprocessor/__optimized-images__/2023-09-19-fairness-reweighing-preprocessor-thumb.png"}},"__N_SSG":true}