{"pageProps":{"mdxSource":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    h2: \"h2\"\n  }, _provideComponents(), props.components), {LinkNew, Link} = _components;\n  if (!Link) _missingMdxReference(\"Link\", true);\n  if (!LinkNew) _missingMdxReference(\"LinkNew\", true);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Last updated: 14.1.2016\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Laboratory of Bioinformatics, Faculty of Computer and Information Science, University of Ljubljana (''us'', ''we'', or ''ours'') operates https://orange.biolab.si (the ''Site''). This page informs you of our policies regarding the collection, use and disclosure of Personal Information we receive from users of the Site.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We use your Personal Information only for providing and improving the Site. By using the Site, you agree to the collection and use of information in accordance with this policy.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Information Collection and Use\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"While using our Site, we may ask you to provide us with certain personally identifiable information that can be used to contact or identify you. Personally identifiable information may include, but is not limited to your name (''Personal Information'').\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Log Data\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Like many site operators, we collect information that your browser sends whenever you visit our Site (''Log Data'').\\nThis Log Data may include information such as your computer's Internet Protocol (''IP'') address, browser type, browser version, the pages of our Site that you visit, the time and date of your visit, the time spent on those pages and other statistics.\\nIn addition, we are using third party services, i.e. Google Analytics, that collect, monitor and analyze these data. If you wish to opt-out of data collection on our site, we recommend you to use \", _jsx(LinkNew, {\n        url: \"https://tools.google.com/dlpage/gaoptout/\",\n        name: \"Google Analytics Opt-Out Add On\"\n      }), \".\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Communications\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We may use your Personal Information to contact you when replying to your contact request or conducting a survey of activities.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Security\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The security of your Personal Information is important to us, but remember that no method of transmission over the Internet, or method of electronic storage, is 100% secure. While we strive to use commercially acceptable means to protect your Personal Information, we cannot guarantee its absolute security.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Changes to this Privacy Policy\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This Privacy Policy is effective as of 14.1.2016 and will remain in effect except with respect to any changes in its provisions in the future, which will be in effect immediately after being posted on this page.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We reserve the right to update or change our Privacy Policy at any time and you should check this Privacy Policy periodically. Your continued use of the Service after we post any modifications to the Privacy Policy on this page will constitute your acknowledgement of the modifications and your consent to abide and be bound by the modified Privacy Policy.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Contact Us\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"If you have any questions about this Privacy Policy, please contact us through the \", _jsx(Link, {\n        url: \"/contact\",\n        name: \"contact form\"\n      }), \" on our website.\"]\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\nfunction _missingMdxReference(id, component) {\n  throw new Error(\"Expected \" + (component ? \"component\" : \"object\") + \" `\" + id + \"` to be defined: you likely forgot to import, pass, or provide it.\");\n}\n","frontmatter":{},"scope":{}},"frontmatter":{"title":"Privacy","url":"/privacy"}},"__N_SSG":true}